about.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<title>About - amohrland</title>
<link rel="stylesheet" type="text/css" href="static/style.css" />
</head>
<body>
<div id="preamble" class="status"><div id="preamble">
<a href="/">Home</a>
<a href="/about.html">About</a>
<a href="/archive.html">Archive</a>
<a href="/tags.html">Tags</a>
<a href="https://github.com/amohrland">GitHub</a>
<a href="/rss.xml">RSS</a>
</div></div>
<div id="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbde6d7f">1. About Me</a></li>
<li><a href="#org87b0711">2. About This Blog</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbde6d7f" class="outline-2">
<h2 id="orgbde6d7f"><span class="section-number-2">1.</span> About Me</h2>
<div class="outline-text-2" id="text-1">
<p>
Welcome! I'm Andrew Mohrland.
</p>

<p>
I'm a software engineer with strengths in distributed systems and event-driven architectures.
</p>

<p>
Recently, I've been focused on the fun world of agentic coding systems.
</p>
</div>
</div>
<div id="outline-container-org87b0711" class="outline-2">
<h2 id="org87b0711"><span class="section-number-2">2.</span> About This Blog</h2>
<div class="outline-text-2" id="text-2">
<p>
This blog is built with <a href="https://github.com/bastibe/org-static-blog">org-static-blog</a> and Emacs <a href="https://orgmode.org">org-mode</a>, hosted on <a href="https://pages.github.com">GitHub Pages</a>.
</p>

<p>
Posts are written as plain <code>.org</code> files and published as static HTML.
</p>
</div>
</div>

</div>
<div id="postamble" class="status"><div id="postamble">
Powered by <a href="https://github.com/bastibe/org-static-blog">org-static-blog</a>
</div></div>
</body>
</html>
